Hello @beevital , I just finish to test the new v1.0.0 version on my existing configuration. Unfortunately, it is leading to an error when I apply my terraform code. Just as information, I tried to run the same code using the v0.7.3 version and it is working well without any error. Bellow is the error I have when compiling with the v1.0.0
`terraform apply --var-file=environment/poc.tfvars --var-file=secret-poc.tfvars  

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fivetran_destination.destination_ressource will be created
  + resource "fivetran_destination" "destination_ressource" {
      + group_id           = (known after apply)
      + id                 = (known after apply)
      + last_updated       = (known after apply)
      + region             = "EU"
      + run_setup_tests    = true
      + service            = "big_query"
      + setup_status       = (known after apply)
      + time_zone_offset   = "+2"
      + trust_certificates = true
      + trust_fingerprints = true

      + config {
          + data_set_location        = "EU"
          + is_private_key_encrypted = (known after apply)
          + project_id               = "971789199149"
          + public_key               = (known after apply)
        }
    }

  # fivetran_group.group_ressource will be created
  + resource "fivetran_group" "group_ressource" {
      + created_at   = (known after apply)
      + id           = (known after apply)
      + last_updated = (known after apply)
      + name         = "sfcc_test_version"
    }

  # module.connector_module["sfcc_config"].fivetran_connector.connector_ressource["0"] will be created
  + resource "fivetran_connector" "connector_ressource" {
      + connected_by       = (known after apply)
      + created_at         = (known after apply)
      + group_id           = (known after apply)
      + id                 = (known after apply)
      + last_updated       = (known after apply)
      + name               = (known after apply)
      + run_setup_tests    = "true"
      + service            = "salesforce_commerce_cloud"
      + trust_certificates = "true"
      + trust_fingerprints = "true"

      + auth {
          + client_access {}
        }

      + config {
          + abs_connection_string                = (known after apply)
          + abs_container_name                   = (known after apply)
          + access_key                           = (known after apply)
          + access_key_id                        = (known after apply)
          + access_token                         = (sensitive value)
          + account                              = (known after apply)
          + account_id                           = (known after apply)
          + account_key                          = (sensitive value)
          + action_report_time                   = (known after apply)
          + agent_host                           = (known after apply)
          + agent_ora_home                       = (known after apply)
          + agent_password                       = (sensitive value)
          + agent_port                           = (known after apply)
          + agent_public_cert                    = (known after apply)
          + agent_user                           = (known after apply)
          + aggregation                          = (known after apply)
          + always_encrypted                     = (known after apply)
          + api_access_token                     = (sensitive value)
          + api_key                              = (sensitive value)
          + api_quota                            = (known after apply)
          + api_requests_per_minute              = (known after apply)
          + api_secret                           = (sensitive value)
          + api_token                            = (sensitive value)
          + api_type                             = (known after apply)
          + api_url                              = (known after apply)
          + api_version                          = (known after apply)
          + app_sync_mode                        = (known after apply)
          + append_file_option                   = (known after apply)
          + archive_pattern                      = (known after apply)
          + asm_option                           = (known after apply)
          + asm_oracle_home                      = (known after apply)
          + asm_password                         = (sensitive value)
          + asm_tns                              = (known after apply)
          + asm_user                             = (known after apply)
          + auth                                 = (known after apply)
          + auth_mode                            = (known after apply)
          + auth_type                            = (known after apply)
          + authorization_method                 = (known after apply)
          + aws_region_code                      = (known after apply)
          + base_url                             = (known after apply)
          + bucket                               = (known after apply)
          + bucket_name                          = (known after apply)
          + bucket_service                       = (known after apply)
          + certificate                          = (known after apply)
          + click_attribution_window             = (known after apply)
          + client_id                            = "0d84127c-1b84-4cb8-8165-2a5bd2377560"
          + client_name                          = (known after apply)
          + client_secret                        = (sensitive value)
          + cloud_storage_type                   = (known after apply)
          + company_id                           = (known after apply)
          + compression                          = (known after apply)
          + config_method                        = (known after apply)
          + config_type                          = (known after apply)
          + connection_method                    = (known after apply)
          + connection_string                    = (known after apply)
          + connection_type                      = (known after apply)
          + consumer_group                       = (known after apply)
          + consumer_key                         = (sensitive value)
          + consumer_secret                      = (sensitive value)
          + container_name                       = (known after apply)
          + conversion_report_time               = (known after apply)
          + conversion_window_size               = (known after apply)
          + csv_definition                       = (known after apply)
          + customer_id                          = (known after apply)
          + customer_list_id                     = "CDC_customer_list"
          + daily_api_call_limit                 = (known after apply)
          + data_access_method                   = (known after apply)
          + data_center                          = (known after apply)
          + database                             = (known after apply)
          + dataset_id                           = (known after apply)
          + datasource                           = (known after apply)
          + date_granularity                     = (known after apply)
          + delimiter                            = (known after apply)
          + domain                               = (known after apply)
          + domain_host_name                     = (known after apply)
          + domain_name                          = (known after apply)
          + domain_type                          = (known after apply)
          + email                                = (known after apply)
          + empty_header                         = (known after apply)
          + enable_all_dimension_combinations    = (known after apply)
          + enable_enrichments                   = (known after apply)
          + enable_exports                       = (known after apply)
          + enable_tde                           = (known after apply)
          + encryption_key                       = (sensitive value)
          + endpoint                             = (known after apply)
          + engagement_attribution_window        = (known after apply)
          + entity_id                            = (known after apply)
          + environment                          = (known after apply)
          + escape_char                          = (known after apply)
          + eu_region                            = (known after apply)
          + export_storage_type                  = (known after apply)
          + external_id                          = (known after apply)
          + file_type                            = (known after apply)
          + finance_account_sync_mode            = (known after apply)
          + folder_id                            = (known after apply)
          + ftp_host                             = (known after apply)
          + ftp_password                         = (sensitive value)
          + ftp_port                             = (known after apply)
          + ftp_user                             = (known after apply)
          + function                             = (known after apply)
          + function_app                         = (known after apply)
          + function_key                         = (known after apply)
          + function_name                        = (known after apply)
          + function_trigger                     = (sensitive value)
          + gcs_bucket                           = (known after apply)
          + gcs_folder                           = (known after apply)
          + group_name                           = (known after apply)
          + has_manage_permissions               = (known after apply)
          + home_folder                          = (known after apply)
          + host                                 = (known after apply)
          + identity                             = (known after apply)
          + instance                             = (known after apply)
          + integration_key                      = (known after apply)
          + is_account_level_connector           = (known after apply)
          + is_auth2_enabled                     = (known after apply)
          + is_custom_api_credentials            = (known after apply)
          + is_ftps                              = (known after apply)
          + is_keypair                           = (known after apply)
          + is_multi_entity_feature_enabled      = (known after apply)
          + is_new_package                       = (known after apply)
          + is_private_key_encrypted             = (known after apply)
          + is_private_link_required             = (known after apply)
          + is_public                            = (known after apply)
          + is_sailthru_connect_enabled          = (known after apply)
          + is_secure                            = (known after apply)
          + is_single_table_mode                 = (known after apply)
          + is_vendor                            = (known after apply)
          + key                                  = (known after apply)
          + last_synced_changes__utc_            = (known after apply)
          + latest_version                       = (known after apply)
          + list_strategy                        = (known after apply)
          + login_password                       = (sensitive value)
          + merchant_id                          = (known after apply)
          + message_type                         = (known after apply)
          + named_range                          = (known after apply)
          + network_code                         = (known after apply)
          + null_sequence                        = (known after apply)
          + oauth_token                          = (sensitive value)
          + oauth_token_secret                   = (sensitive value)
          + on_error                             = (known after apply)
          + on_premise                           = (known after apply)
          + organization                         = (known after apply)
          + organization_id                      = "f_ecom_bfnf_dev"
          + passphrase                           = (sensitive value)
          + password                             = (sensitive value)
          + pat                                  = (sensitive value)
          + path                                 = (known after apply)
          + pattern                              = (known after apply)
          + pdb_name                             = (known after apply)
          + pem_certificate                      = (sensitive value)
          + port                                 = (known after apply)
          + post_click_attribution_window_size   = (known after apply)
          + prebuilt_report                      = (known after apply)
          + prefix                               = (known after apply)
          + private_key                          = (sensitive value)
          + project_id                           = (known after apply)
          + public_key                           = (known after apply)
          + publication_name                     = (known after apply)
          + query_id                             = (known after apply)
          + region                               = (known after apply)
          + replica_id                           = (known after apply)
          + replication_slot                     = (known after apply)
          + report_type                          = (known after apply)
          + report_url                           = (known after apply)
          + resource_url                         = (known after apply)
          + rest_api_limit                       = (known after apply)
          + role                                 = (known after apply)
          + role_arn                             = (sensitive value)
          + rollback_window_size                 = (known after apply)
          + s3bucket                             = (known after apply)
          + s3external_id                        = (known after apply)
          + s3folder                             = (known after apply)
          + s3role_arn                           = (sensitive value)
          + sales_account_sync_mode              = (known after apply)
          + sap_user                             = (known after apply)
          + secret                               = (sensitive value)
          + secret_key                           = (sensitive value)
          + secrets                              = (sensitive value)
          + security_protocol                    = (known after apply)
          + server_url                           = (known after apply)
          + service_version                      = (known after apply)
          + sftp_host                            = (known after apply)
          + sftp_is_key_pair                     = (known after apply)
          + sftp_password                        = (sensitive value)
          + sftp_port                            = (known after apply)
          + sftp_user                            = (known after apply)
          + share_url                            = (known after apply)
          + sheet_id                             = (known after apply)
          + shop                                 = (known after apply)
          + short_code                           = (sensitive value)
          + show_records_with_no_metrics         = (known after apply)
          + sid                                  = (known after apply)
          + site_id                              = "CDC-ROE"
          + skip_after                           = (known after apply)
          + skip_before                          = (known after apply)
          + soap_uri                             = (known after apply)
          + source                               = (known after apply)
          + sub_domain                           = (known after apply)
          + subdomain                            = (known after apply)
          + support_connected_accounts_sync      = (known after apply)
          + support_nested_columns               = (known after apply)
          + swipe_attribution_window             = (known after apply)
          + sync_data_locker                     = (known after apply)
          + sync_format                          = (known after apply)
          + sync_formula_fields                  = (known after apply)
          + sync_metadata                        = (known after apply)
          + sync_method                          = (known after apply)
          + sync_mode                            = (known after apply)
          + sync_multiple_accounts               = (known after apply)
          + sync_pack_mode                       = (known after apply)
          + sync_pull_api                        = (known after apply)
          + sync_type                            = (known after apply)
          + technical_account_id                 = (known after apply)
          + test_table_name                      = (known after apply)
          + time_zone                            = (known after apply)
          + timeframe_months                     = (known after apply)
          + tns                                  = (known after apply)
          + token_key                            = (sensitive value)
          + token_secret                         = (sensitive value)
          + tunnel_host                          = (known after apply)
          + tunnel_port                          = (known after apply)
          + tunnel_user                          = (known after apply)
          + unique_id                            = (known after apply)
          + update_config_on_each_sync           = (known after apply)
          + update_method                        = (known after apply)
          + uri                                  = (known after apply)
          + use_api_keys                         = (known after apply)
          + use_customer_bucket                  = (known after apply)
          + use_oracle_rac                       = (known after apply)
          + use_pgp_encryption_options           = (known after apply)
          + use_service_account                  = (known after apply)
          + use_template_labels                  = (known after apply)
          + use_webhooks                         = (known after apply)
          + use_workspace                        = (known after apply)
          + user                                 = (known after apply)
          + user_id                              = (known after apply)
          + user_key                             = (known after apply)
          + user_name                            = (known after apply)
          + username                             = (known after apply)
          + view_attribution_window              = (known after apply)
          + view_through_attribution_window_size = (known after apply)
          + workspace_same_as_source             = (known after apply)
        }

      + destination_schema {
          + name = "sfcc_dnd"
        }
    }

  # module.connector_module["sfcc_config"].fivetran_connector_schedule.test_connector_schedule["0"] will be created
  + resource "fivetran_connector_schedule" "test_connector_schedule" {
      + connector_id      = (known after apply)
      + daily_sync_time   = "06:00"
      + id                = (known after apply)
      + pause_after_trial = "false"
      + paused            = "false"
      + schedule_type     = "auto"
      + sync_frequency    = "1440"
    }

  # module.connector_module["sfcc_config"].google_bigquery_dataset.destination_dataset will be created
  + resource "google_bigquery_dataset" "destination_dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "sfcc_dnd"
      + delete_contents_on_destroy = false
      + description                = "sfcc_dnd source synced by Fivetran"
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + labels                     = {
          + "env"  = "poc"
          + "etl"  = "fivetran"
          + "type" = "raw_reporting"
        }
      + last_modified_time         = (known after apply)
      + location                   = "EU"
      + project                    = "971789199149"
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + dataset {
              + target_types = (known after apply)

              + dataset {
                  + dataset_id = (known after apply)
                  + project_id = (known after apply)
                }
            }

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + config = {
      + sfcc_config = {
          + config_module = []
        }
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fivetran_group.group_ressource: Creating...
module.connector_module["sfcc_config"].google_bigquery_dataset.destination_dataset: Creating...
fivetran_group.group_ressource: Creation complete after 1s [id=transpire_besought]
fivetran_destination.destination_ressource: Creating...
module.connector_module["sfcc_config"].google_bigquery_dataset.destination_dataset: Creation complete after 2s [id=projects/971789199149/datasets/sfcc_dnd]
module.connector_module["sfcc_config"].fivetran_connector.connector_ressource["0"]: Creating...
╷
│ Error: Plugin did not respond
│
│   with fivetran_destination.destination_ressource,
│   on main.tf line 27, in resource "fivetran_destination" "destination_ressource":
│   27: resource "fivetran_destination" "destination_ressource" {
│
│ The plugin encountered an error, and failed to respond to the plugin.(*GRPCProvider).ApplyResourceChange    
│ call. The plugin logs may contain more details.
╵
╷
│ Error: Plugin did not respond
│
│   with module.connector_module["sfcc_config"].fivetran_connector.connector_ressource["0"],
│   on modules\fivetran_configuration\main.tf line 38, in resource "fivetran_connector" "connector_ressource":│   38: resource "fivetran_connector" "connector_ressource" {
│
│ The plugin encountered an error, and failed to respond to the plugin.(*GRPCProvider).ApplyResourceChange    
│ call. The plugin logs may contain more details.
╵

Stack trace from the terraform-provider-fivetran_v1.0.0.exe plugin:

panic: interface conversion: interface {} is nil, not map[string]interface {}

goroutine 113 [running]:
github.com/fivetran/terraform-provider-fivetran/fivetran.resourceConnectorUpdateCustomAuth(0xc0000c33e4?)     
        github.com/fivetran/terraform-provider-fivetran/fivetran/resource_connector.go:315 +0x657
github.com/fivetran/terraform-provider-fivetran/fivetran.resourceConnectorCreate({0x1611938, 0xc000514d00}, 0x1400ca0?, {0x14cee60?, 0xc0008b21e0?})
        github.com/fivetran/terraform-provider-fivetran/fivetran/resource_connector.go:113 +0x574
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).create(0xc0008c2f60?, {0x1611938?, 0xc000514d00?}, 0x2?, {0x14cee60?, 0xc0008b21e0?})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.10.0/helper/schema/resource.go:336 +0x84
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).Apply(0xc0005c67e0, {0x1611938, 0xc000514d00}, 0xc0000ab040, 0xc000177c80, {0x14cee60, 0xc0008b21e0})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.10.0/helper/schema/resource.go:467 +0x705
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*GRPCProviderServer).ApplyResourceChange(0xc000305710, {0x1611938, 0xc000514d00}, 0xc00009e820)
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.10.0/helper/schema/grpc_provider.go:977 +0xde5        
github.com/hashicorp/terraform-plugin-go/tfprotov5/tf5server.(*server).ApplyResourceChange(0xc000176280, {0x16119e0?, 0xc0008c3e90?}, 0xc000157420)
        github.com/hashicorp/terraform-plugin-go@v0.5.0/tfprotov5/tf5server/server.go:603 +0x2ad
github.com/hashicorp/terraform-plugin-go/tfprotov5/internal/tfplugin5._Provider_ApplyResourceChange_Handler({0x14adbe0?, 0xc000176280}, {0x16119e0, 0xc0008c3e90}, 0xc0000943c0, 0x0)
        github.com/hashicorp/terraform-plugin-go@v0.5.0/tfprotov5/internal/tfplugin5/tfplugin5_grpc.pb.go:380 
+0x170
google.golang.org/grpc.(*Server).processUnaryRPC(0xc00027efc0, {0x16153c0, 0xc000678000}, 0xc0006d4100, 0xc00054da40, 0x1af46e0, 0x0)
        google.golang.org/grpc@v1.32.0/server.go:1194 +0xcab
google.golang.org/grpc.(*Server).handleStream(0xc00027efc0, {0x16153c0, 0xc000678000}, 0xc0006d4100, 0x0)     
        google.golang.org/grpc@v1.32.0/server.go:1517 +0xa2f
google.golang.org/grpc.(*Server).serveStreams.func1.2()
created by google.golang.org/grpc.(*Server).serveStreams.func1
        google.golang.org/grpc@v1.32.0/server.go:857 +0x28a

Error: The terraform-provider-fivetran_v1.0.0.exe plugin crashed!

This is always indicative of a bug within the plugin. It would be immensely
helpful if you could report the crash with the plugin's maintainers so that it`